$packages$

$EDA$

In [ ]:
1)pandas:dataframe analysis
2)numpy:numerical python/number python
3)matplotlib:plot
4)seaborn:plot
5)plotly:plot
6)bokhe:plot

$ML$

In [ ]:
1)scikit-learn(sk-learn):all ml algorithms

$DL$

In [ ]:
1)tensorflow
2)kerras
3)pytorch
4)cv:computer vision

$NLP$

In [ ]:
1)nlpk
2)Scipy

$generative AI$

In [ ]:
1)chatgpt:open AI
2)makerswite:google generative AI
3)amazon Q

$hugging-face-transformers (BERT)$

In [ ]:
1)transformers

$others$

In [ ]:
1)random
2)math
3)os
4)sys
5)time

$azure ML$

In [ ]:
1)azure packages
2)gcp vertex AI
3)aws:sage maker

$step-1:
    -$import$  $required$  $packages$

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

$step-2:$read$ $the$ $data

In [ ]:
visadataset
#file location
#file name
#extention

In [6]:
file_path="C:\\Users\\shrav\\Downloads\\Visadataset - Visadataset.csv"
pd.read_csv(file_path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [7]:
file_path="C:\\Users\\shrav\\Downloads\\bank - bank.csv"
pd.read_csv(file_path)
#pd.read_csv(file_path,sep=";")===if in "a" cell only full data is there then seperate it with sep=";"

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4516,33,services,married,secondary,no,-333,yes,no,cellular,30,jul,329,5,-1,0,unknown,no
4517,57,self-employed,married,tertiary,yes,-3313,yes,yes,unknown,9,may,153,1,-1,0,unknown,no
4518,57,technician,married,secondary,no,295,no,no,cellular,19,aug,151,11,-1,0,unknown,no
4519,28,blue-collar,married,secondary,no,1137,no,no,cellular,6,feb,129,4,211,3,other,no
4520,44,entrepreneur,single,tertiary,no,1136,yes,yes,cellular,3,apr,345,2,249,7,other,no

$step-3$:create a dataframe using lists

In [8]:
list1=["ram","raheem","robert"]
list2=[30,31,32]
pd.DataFrame(zip(list1,list2),columns=["name","age"])

     name  age
0     ram   30
1  raheem   31
2  robert   32

In [9]:
list1=["ram","raheem","robert"]
list2=[30,31,32]
cols=["name","age"]
names=pd.DataFrame(zip(list1,list2),columns=cols)

In [10]:
names

     name  age
0     ram   30
1  raheem   31
2  robert   32

$step-4$:how to save the dataframe in local

In [11]:
#what is your dataframe name:names
#where you want to save:
#what name you want to provide:NAMES
names.to_csv("C:\\Users\\shrav\\Desktop\\EDA with python\\NAMES.csv")

In [12]:
names.to_csv("NAMES.csv")

In [13]:
names.to_csv("NAMES1.csv",index=False)
#it will not create extra column as index

$task-1$
*read NAMES and NAMES1*

In [14]:
file_path=("C:\\Users\\shrav\\Desktop\\EDA with python\\NAMES.csv")
pd.read_csv(file_path)

   Unnamed: 0    name  age
0           0     ram   30
1           1  raheem   31
2           2  robert   32

In [15]:
file_path=("C:\\Users\\shrav\\Desktop\\EDA with python\\NAMES1.csv")
pd.read_csv(file_path)

     name  age
0     ram   30
1  raheem   31
2  robert   32

$step-5$: add a new create to existing dataframe

In [16]:
names
#what is ur dataframe name:names
#what is the name of the column u want to add :city
#how many rows in original data:3
#what is ur new data=["Hyd","Chennai","Blr"]

     name  age
0     ram   30
1  raheem   31
2  robert   32

In [17]:
names["city"]=["Hyd","Chennai","Blr"]

In [18]:
names

     name  age     city
0     ram   30      Hyd
1  raheem   31  Chennai
2  robert   32      Blr

In [19]:
names["id"]=[1,2,3,4]
#Length of values (4) does not match length of index (3)

ValueError: Length of values (4) does not match length of index (3)

$step-6$:-how to drop

In [ ]:
#what is ur dataframe name:names
============axis=========
#i want to drop column
#axis=1===============cloumns
#axis=0===============rows
==============================================
#what is the name of the column:city
=======================inplace=========================
#when your droping the cloumn means u are modifing the table
#the dataframe overwrite or
#you want to create a dataframe
#inplace=True:data will be overwrite

In [20]:
names.drop("city",
           axis=1,
           inplace=True)

In [21]:
names

     name  age
0     ram   30
1  raheem   31
2  robert   32

$how$ $to$ $create$ $a$ $dataframe$ $using$ $dictioanry$

In [22]:
dict1={"names":["ram","robert","raheem"],"age":[30,31,32]}
dict1

{'names': ['ram', 'robert', 'raheem'], 'age': [30, 31, 32]}

In [25]:
pd.DataFrame(dict1)

    names  age
0     ram   30
1  robert   31
2  raheem   32

In [ ]:
-if i give list or dictionary
-you need to able to create a dataframe